[
  {
    "profile_image": "/images/members/신항식.jpg",
    "role": "Principal Investigator",
    "name_eng": "Hangsik Shin",
    "degree": "Ph.D.",
    "email": "hangsik.shin@amc.seoul.kr",
    "tags": "#Biosignal processing #Clinical decision support #Digital Healthcare #Internet of Medical Things #Medical data analysis",
    "hover_image": "/images/members/egg_신항식2.PNG",
    "profile_description": "Professor  \r\nDepartment of Digital Medicine  \r\nAsan Medical Center, University of Ulsan College of Medicine  \r\n[Google Scholar Profile](https://scholar.google.co.kr/citations?user=N1MUdi4AAAAJ&hl=en)",
    "contents": "## Employment\r\n\r\n1.  2025.03 – Current  \r\n    Professor  \r\n    Dept. of Digital Medicine, Asan Medical Center, University of Ulsan College of Medicine, Seoul, South Korea\r\n2.  2022.03 – 2025.02  \r\n    Associate Professor  \r\n    Dept. of Digital Medicine, Asan Medical Center, University of Ulsan College of Medicine, Seoul, South Korea\r\n3.  2013.09 – 2022.02  \r\n    Assistant & Associate Professor  \r\n    Dept. of Biomedical Engineering, Chonnam National University, Yeosu, South Korea\r\n4.  2010.03 – 2013.08  \r\n    Senior Engineer  \r\n    Healthcare & Sensing Lab., Digital Media and Communication Research Center, Samsung Electronics, Suwon, South Korea\r\n5.  2003.03 – 2011.02  \r\n    Researcher  \r\n    Yonsei Institute of Medical Instrument Technology, Yonsei University, Seoul, South Korea\r\n\r\n## Activity\r\n\r\n1.  Review Board, National Research Foundation (NRF) of Korea\r\n2.  Korea Standard Expert Committee, Korea Food and Drug Administration\r\n3.  Medical Device Expert Committee, Korea Food and Drug Administration\r\n4.  National Standard Expert of ISO/TC121 (Anesthesia and respiration device), Korea Food and Drug Administration\r\n5.  Director, The Korean Society of Medical & Biological Engineering (KOSOMBE)\r\n6.  Director, The Korean Institute of Electrical Engineers (KIEE)\r\n7.  Director, Korean Institute of Intelligence Systems (KIIS)\r\n\r\n## Awards\r\n\r\n1.  Best Editor Awards, Journal of Electrical Engineering & Technology\r\n2.  KIEE-Scholar Award, The Korean Institute of Electrical Engineers (KIEE)\r\n3.  KMBES Awards, Korean Biomedical Engineering Society (KBMES)\r\n4.  Lutronic Young Investigator Awards, The Korean Society of Medical & Biological Engineering (KOSOMBE)\r\n5.  Young Investigator Award, Korean Institute of Intelligent Systems (KIIS)"
  },
  {
    "profile_image": "/images/members/진재욱.jpg",
    "role": "Ph.D. Course",
    "name_eng": "Jaewook Jin",
    "degree": "M.S.",
    "email": "realwooook@gmail.com",
    "tags": "#Biosignal analysis #Biomedical engineering",
    "hover_image": "/images/members/egg_진재욱.jpeg",
    "profile_description": "Ph.D candidate  \r\n[realwooook@gmail.com](realwooook@gmail.com)  \r\nResearch Areas : Biosignal analysis, Biomedical engineering",
    "contents": "## Papers & Conferences\r\n\r\n1.  Jaewook Jin, Kahye Kim, KunHo Lee, Jeong-Woo Seo, Jaeuk U. Kim, \"Association Between Cognitive Function and the Autonomic Nervous System by Photoplethysmography\", Bioengineering 2024, 11(11), 1099, 2024"
  },
  {
    "profile_image": "/images/members/류가연.jpeg",
    "role": "Master Course",
    "name_eng": "Gayeon Ryu",
    "degree": "B.Sc.",
    "email": "rgy90257823@gmail.com",
    "tags": "#Data analysis #Statistical #Machine learning",
    "hover_image": "/images/members/egg_류가연.JPG",
    "profile_description": "Master Course  \r\n[rgy90257823@gmail.com](mailto:rgy90257823@gmail.com)  \r\nResearch Areas : Data Analysis, Statistics, Signal Analysis",
    "contents": "## Papers & Conferences\r\n\r\n1.  Gayeon Ryu,Jae Moon Choi,Hyeon Seok Seok,Jaehyung Lee,Eun-Kyung Lee,Hangsik Shin,Byung-Moon Choi, \"Machine learning based quantitative pain assessment for the perioperative period\", NPJ DIGITAL MEDICINE (2025)\r\n2.  Gayeon Ryu, Jae Moon Choi, Jaehyung Lee, Hyeon Seok Seok, Hangsik Shin, Byung-Moon Choi, \"Analysis of Photoplethysmography-Based Surgical Pain Severity Assessment Markers\", JOURNAL OF ELECTRICAL ENGINEERING & TECHNOLOGY (2024)\r\n3.  Jaehyung Lee, Oh-Seok Kwon, Gayeon Ryu, Hangsik Shin, Hui-Nam Pak, \"Atrial Fibrillation Identification Using CNNs Based on Genomic Data\", JOURNAL OF ELECTRICAL ENGINEERING & TECHNOLOGY (2024)\r\n4.  Gayeon Ryu, Ye Eun Choi, Hangsik Shin, \"The Impact of Demographic Characteristics and Comorbidities on the Incidence of Atrial Fibrillation\", The 64th Korea Society of Medical and Biological Engineering Fall Conference 2024, Seoul, Korea (Nov. 2024)\r\n5.  Gayeon Ryu, Yujin Han, Yeongdon Kim, Hangsik Shin, \"Bio-signals and result feature analysis to leverage public polysomnography database integration\", The 64th Korea Society of Medical and Biological Engineering Fall Conference 2024, Seoul, Korea (Nov. 2024)\r\n6.  Gayeon Ryu, Ye Eun Choi, Hangsik Shin, \"Evaluation of Photoplethysmogram-based Vascular Age Estimation Models\", CICS'24 Conference on Information and Control Systems, Tongyeong, Korea (Oct. 2024)\r\n7.  Yeongdon Kim, Hamin Lim, Gayeon Ryu, Yujin Han, Hangsik Shin, \"Development of a Real-Time Upper Limb Range of Motion Measurement Method Using a Single Depth Measurement Camera\", The 55th KIEE Summer Conference, Jeju, Korea (Jul. 2024)\r\n8.  Y.Kim, G.Y Ryu, H.H Jeong, J. H. Oh, M. Kim, S. A. Park, H. L. Yang, \"Development of interoprative blood transfusion prediction model\", CARS 2024 Computer Assisted Radiology and Surgery, Barcelona, Spain (Jun. 2024)\r\n9.  Gayeon Ryu, Hyeon Seok Seok, Byung-Moon Choi, Jae Moon Choi, Hangsik Shin, \"Photopletysmogram Features for Severity Assessment of Postoperative Pain\", KOSOMBE spring conference, Wonju, Korea (May. 2024)\r\n10.  Gayeon Ryu, Hyeon Seok Seok, Byung-Moon Choi, Jae Moon Choi, Hangsik Shin, \"Ectopic Beat Correction Strategies for Accurate Heart Rate Variability Analysis\", IEEE EMBS, St. Julians, Malta (Dec. 2023)\r\n11.  Gayeon Ryu, Hyeon Seok Seok, Byung-Moon Choi, Jae Moon Choi, Hangsik Shin, \"Photoplethysmogram based on Surgical Pain Severity Assessment Feature Analysis\", KOSOMBE autumn conference, Seoul, Korea (Nov. 2023)\r\n12.  Gayeon Ryu, Hyeon Seok Seok, Byung-Moon Choi, Jae Moon Choi, Hangsik Shin, \"Analysis of Surgical Pain Severity Assessment Feature based on Photoplethysmogram\", The 54th KIEE Summer Conference, Pyeongchang, Korea (Jul. 2023)\r\n13.  Hyeon Seok Seok, Ga Yeon Ryu, Hangsik Shin, Byeong-mun Choi, Jae-moon Choi, \"Arrival Times of Maximum Pain and Pain Suppression After Acute Pain Stimulation in Surgical Procedure\", 43st Annual International Conference of the IEEE Engineering in Medicine and Biology Society (EMBC'21), EMBC, Sydney, Australia (Jul. 2023)\r\n14.  Ga Yeon Ryu, Hyeon Seok Seok, Hangsik Shin, Byung-Moon Choi , Jae Moon Choi, \"Analysis of a surgical pain severity assessment feature based on photoplethysmogram\", The 54th KIEE Summer Conference, Pyeongchang, Korea (Jun. 2023)\r\n15.  Ga Yeon Ryu, Hyeon Seok Seok, Hangsik Shin, Byung-Moon Choi, Jae Moon Choi, \"Development of photoplethysmogram based feature for intra- and post-operative pain\", KOSOMBE spring conference, Daegu, Korea (May. 2023)\r\n16.  Hyeon Seok Seok, Ga Yeon Ryu, Hangsik Shin, Jae Moon Choi, Byung-Moon Choi, \"Development of an artificial intelligence model for both intra- and post-operative pain assessment\", The Korean Society for Anesthetic Pharmacology (KSAP), Seoul, Korea (Apr. 2023)\r\n17.  Ga Yeon Ryu, Hyeon Seok Seok, Changwon Wang, Byung-Moon Choi, Jae Moon Choi, Hangsik Shin, \"Photoplethysmogram Feature Analysis for Surgical Pain Assessment\", KOSOMBE autumn conference, Incheon, Korea (Nov. 2022)\r\n18.  Ga Yeon Ryu, Hyeon Seok Seok, Changwon Wang, Byung-Moon Choi, Jae Moon Choi, Hangsik Shin, \"Comparison of Photoplethysmogram Feature for Intraoperative Pain and Postoperative Pain\", Conference on Information and Control Systems 2022 (CICS), Pyeongchang, Korea (Oct. 2022)\r\n\r\n## awards\r\n\r\n1.  대한의용생체공학회 2024 추계학술대회 우수 포스터 논문상, 대한의용생체공학회, Korea (Nov. 2024)\r\n2.  대한의용생체공학회 2024년 추계학술대회 우수논문상, 대한의용생체공학회, Korea (Nov. 2024)\r\n3.  2024년 정보 및 제어 학술대회 우수논문상, 대한전기학회, Korea (Oct. 2024)\r\n4.  Best Abstract Awards, Spring Conference, Korean Society for Anesthetic Pharmacology, Korea (Apr. 2023)\r\n5.  Paper of the Year Award, AMIST 종합학술대회, Korea (Nov. 2022)\r\n\r\n## patents\r\n\r\n1.  신항식ㆍ최병문 ㆍ 최재문ㆍ류가연, \"통증평가모델 생성 장치, 통증평가모델 생성 방법 및 이를 수행하는 프로 그램이 저장된 기록 매체\", KR-Application No. 10-2024-0053680\r\n\r\n## Participated Projects\r\n\r\n1.  Development and Commercialization of Next Generation Convergence Care Technology for Optimization of High Risk Patient Treatment, Ministry of Health and Welfare (MOHW), Korea (Jul. 2020 ~ Present)\r\n2.  Research of Photoplethysmography for Mobile Healthcare and Clinical Use, Ministry of Education (MOE), Korea (Jun. 2018 ~ May. 2023)\r\n3.  Development of a Wearable Device That Shows Pain Relief Using Complex Energy (Cold Razor + Ultrasound) and Pain Relief Using Photoplethysmography, Ministry of SMEs and Startups (MSS), Korea (Dec. 2020 ~ Dec. 2022)"
  },
  {
    "profile_image": "/images/members/이재형.jpeg",
    "role": "Master Course",
    "name_eng": "Jaehyung Lee",
    "degree": "B.Eng.",
    "email": "zeus9656@gmail.com",
    "tags": "#GNN #Image classification #Medical AI",
    "hover_image": "/images/members/egg_이재형.jpg",
    "profile_description": "Master Course  \r\n[zeus9656@gmail.com](zeus9656@gmail.com)  \r\nResearch Areas : GNN, Image classification, Medical AI",
    "contents": "## Papers & Conferences\r\n\r\n1.  Jaehyung Lee, Hyeon Seok Seok, Oh-Seok Kwon, Hui-Nam Pak and Hangsik Shin, \"Analyzing the Performance of a Convolutional Neural Network-based Atrial Fibrillation Classifier According to the Genetic Screening Thresholds,\" The 54th KIEE Summer Conference 2023, Yongpyong Resort, Pyeongchang, Republic of Korea, 12-15 Jul 2023\r\n2.  Jaehyung Lee, Hyeon Seok Seok, Oh-Seok Kwon, Hui-Nam Pak and Hangsik Shin, \"The Impact of Regularization Techniques on Convolutional Neural Network-based Genomic Study,\" KOSOMBE spring conference 2023, KMEDIhub, Daegu, Republic of Korea, 11-13 May 2023\r\n3.  Jaehyung Lee, Changwon Wang, Hyeon Seok Seok, Oh-Seok Kwon, Hui-Nam Pak and Hangsik Shin, \"GWASbased Atrial Fibrillation Identification Using DCNN,\" KOSOMBE autumn conference 2022, Paradise city Hotel, Incheon, Republic of Korea, 3-5 Nov 2022\r\n4.  Jaehyung Lee, Changwon Wang, Hyeon Seok Seok, Oh-Seok Kwon, Hui-Nam Pak and Hangsik Shin, \"GenomeWide Association Studies and Electronic Medical Record based Atrial Fibrillation Discriminat ion Using Ensemble Models,\" Conference on Information and Control Systems 2022(CICS), Alpensia Resort, Pyeongchang, Republic of Korea, 19-22 Oct 2022\r\n\r\n## awards\r\n\r\n1.  Best Poster Awards, 2022 AMIST Annual Conference, 2022\r\n\r\n## Participated Projects\r\n\r\n1.  Development of AI Software as Medical Device for Management of Full-Cycle of Atrial Fibrillation Based on Cardiac Digital Twin\r\n2.  Optimization and Clinical Verification of Software for Early Diagnosis and Prognosis of Atrial Fibrillation Integrating Gene, Electrocardiogram, and Clinical Information Based on Artificial Intelligence"
  },
  {
    "profile_image": "/images/members/최예은.jpg",
    "role": "Master Course",
    "name_eng": "Ye Eun Choi",
    "degree": "B.Sc",
    "email": "yechoi.amc@gmail.com",
    "tags": "#Bioinformatics #Medical AI #Digital Healthcare",
    "hover_image": "/images/members/egg_최예은.JPG",
    "profile_description": "Master Course  \r\n[yechoi.amc@gmail.com](mailto:yechoi.amc@gmail.com)  \r\nResearch Areas : Bioinformatics,Medical AI,Digital Healthcare",
    "contents": "## Papers & Conferences\r\n\r\n1.  Muhyuk Kim, Hanbyul Song, Sung Joo Han, Ye Eun Choi, Hyebong Choi, Taejin Ahn. Differentially Expressed Genes Analysis of cancer developed by user centered web interface. \"The 17th KOGO Winter Symposium,\" 한국유전체학회(KOGO), Seoul, Korea, Jan. 2021 - Conference poster\r\n2.  Seonyeong Park, Mingu Lee, Ye-eun Choi, Hyebong Choi. 반응형 정보 시각화를 통한 정보 전달의 효율성: 코로나 19 감염증 확산과 방역 정책을 중심으로. \"한국HCI학회 학술대회,\" 한국HCI학회, Seoul, Korea, Jan. 2021 - Conference paper\r\n3.  Jaehyung Lee, Oh-Seok Kwon, Ye Eun Choi, Hangsik Shin, Hui-Nam Pak, “Atrial Fibrillation Diagnosis Using Machine Learning: Leveraging Minimal Health Data from UK Biobank,” IEEE EMBS International Conference on Data Science and Engineering in Healthcare, Medicine & Biology, Malta, 07-09 Dec 2023 - Conference poster\r\n4.  Ye Eun Choi, Jaehyung Lee, Hyeon Seok Seok and Hangsik Shin, “Demographics and Comorbidities as an Atrial Fibrillation Risk Factor: a Retrospective Study in Koreans,” The 46th Annual International Conference of the IEEE Engineering in Medicine and Biology Society (EMBC), Orlando, Florida, USA, 15-19 July 2024 - Conference poster\r\n5.  Gayeon Ryu, Ye Eun Choi and Hangsik Shin, \"Evaluation of Photoplethysmogram-based Vascular Age Estimation Models,\" CICS'24 Conference on Information and Control Systems , Kumho Tongyeong Marina Resort, Tongyeong, Republic of Korea, 23-26 Oct 2024 - Oral Presentation\r\n6.  Gayeon Ryu, Ye Eun Choi and Hangsik Shin, \"The Impact of Demographic Characteristics and Comorbidities on the Incidence of Atrial Fibrillation,\" The 64th Korea Society of Medical and Biological Engineering Fall Conference 2024, Swiss Grand Hotel, Seoul, Republic of Korea, 07-09 Nov 2024 - Oral Presentation\r\n7.  Ye Eun Choi, Hangsik Shin, “Survival Analysis of Adult Sepsis Patients based on Demographics and Underlying Diseases,” The 64th Korea Society of Medical and Biological Engineering Fall Conference 2024, Swiss Grand Hotel, Seoul, Republic of Korea, 07-09 Nov 2024 - Conference poster\r\n8.  Ye Eun Choi, Hangsik Shin, “Analysis of Mortality Risk in Adult Sepsis Patients based on Demographics and Underlying Diseases,” The 64th Korea Society of Medical and Biological Engineering Fall Conference 2024, Swiss Grand Hotel, Seoul, Republic of Korea, 07-09 Nov 2024 - Conference poster\r\n\r\n## awards\r\n\r\n1.  2022 데이터 청년 캠퍼스 ‘우수 프로젝트 발표’ 장려상, 한국데이터산업진흥원(Korea Data Agency), Korea (Sep. 2022)\r\n2.  Best Paper Awards \\[Silver\\], Fall Conference, Korean Society of Medical and Biological Engineering, Korea (Nov. 2024)\r\n\r\n## Participated Projects\r\n\r\n1.  Development, Optimization and Clinical Verification of Software for Early Diagnosis and Prognosis of Atrial Fibrillation Integrating Gene, Electrocardiogram and Clinical Information Based on Artificial Intelligence, Ministry of Health and Wellfare (MOHW), Korea (Apr. 2021 - Dec. 2023)\r\n2.  Developing artificial intelligence for early risk predictionof atrial fibrillation using clinical information, Asan Medical Center, Korea (Jan. 2024 - Dec. 2025)"
  },
  {
    "profile_image": "/images/members/한유진_0.png",
    "role": "Master Course",
    "name_eng": "Yu Jin Han",
    "degree": "B.Sc.",
    "email": "yujin.han.ds@gmail.com",
    "tags": "#Statistics #Machine learning",
    "hover_image": "/images/members/egg_한유진.jpg",
    "profile_description": "Master Course  \r\n[yujin.han.ds@gmail.com](mailto:yujin.han.ds@gmail.com)  \r\nResearch Areas : Statistics, Machine learning",
    "contents": "## Papers & Conferences\r\n\r\n1.  Yujin Han, Hangsik Shin, \"Harmonization Pipeline for Correcting Data Discrepancies in Multicenter Radiomic Tractometry Studies\", The 65th Korea Society of Medical and Biological Engineering Spring Conference 2025, Lotte Hotel Jeju, Jeju, Korea (May. 2025)\r\n2.  Yujin Han, Sung Woo Joo, Hangsik Shin, \"Radiomic Tractometry-Based Machine Learning Model for Schizophrenia Classification\", The 65th Korea Society of Medical and Biological Engineering Spring Conference 2025, Lotte Hotel Jeju, Jeju, Korea (May. 2025)\r\n3.  Gayeon Ryu, Yujin Han, Yeongdon Kim, Hangsik Shin, “Bio-signals and result feature analysis to leverage public polysomnography database integration”, The 64th Korea Society of Medical and Biological Engineering Fall Conference 2024, Swiss Grand Hotel, Seoul, Korea (Nov. 2024)\r\n4.  Yeongdon Kim, Hamin Lim, Gayeon Ryu, Yujin Han, Hangsik Shin, \"Development of a Real-Time Upper Limb Range of Motion Measurement Method Using a Single Depth Measurement Camera\", The 55th KIEE Summer Conference, Jeju, Korea (Jul. 2024)\r\n5.  한유진, 김준식, 김재희. 뇌전증 환자의 MEG 데이터에 대한 분류를 위한 인공신경망 적용 연구. 응용통계연구. 37(2), 139-155. (2024).\r\n6.  한유진, 김재희. TERGM 과 SAOM 비교: 학생 네트워크 데이터의 통계적 분석. 응용통계연구. 36(1), 1-19. (2023).\r\n7.  박예진, 엄정민, 홍수빈, 한유진, 김재희. 직장 네트워크 데이터에 대한 통계적 ERGM 분석. 응용통계연구. 35(4), 527-541. (2022).\r\n\r\n## awards\r\n\r\n1.  대한의용생체공학회 춘계 학술대회 최우수 포스터상, 대한의용생체공학회, 2025.05\r\n2.  대한의용생체공학회 추계 학술대회 우수 포스터 논문상(금상), 대한의용생체공학회, 2024.11\r\n3.  2023 이브와 ICT멘토링 공모전 금상(과학기술정보통신부장관상), 과학기술정보통신부(주최), 정보통신기획평가원(주관), IT여성기업인협회(주관), 2023.12"
  },
  {
    "profile_image": "/images/members/임하민1.JPG",
    "role": "Researcher",
    "name_eng": "Hamin Lim",
    "degree": "M.S.",
    "email": "hamin971203@gmail.com",
    "tags": "#Biosignal analysis #Digital Healthcare",
    "hover_image": "/images/members/egg_임하민.jpg",
    "profile_description": "Researcher  \r\n[hamin971203@gmail.com](hamin971203@gmail.com)  \r\nResearch Areas : Biosignal analsysis,Digital Healthcare",
    "contents": "## Journal\r\n\r\n1.  Haeun Yum, Hamin Lim et al. “Effects of shear-thickening polymer on force attenuation capacities in hip protectors. Proceedings of the Institution of Mechanical Engineers” Part C: Journal of Mechanical Engineering Science. 2022;236(8):3881-3885.\r\n2.  Hamin Lim, Hangsik Shin, “Clustering Analysis of Activity of Daily Living based on Accelerometry.” The Transactions of the Korean Institute of Electrical Engineers KIEE Vol. 72, No. 11, p.1427-1433\r\n\r\n## Conference Papers\r\n\r\n1.  Changwon Wang, Hamin Lim, Sung Woo Joo, Jungsun Lee, Hangsik Shin, “Investigating Abnormal Behavior Patterns in Psychiatric Inpatients” IEEE-EMBS International Conference on Biomedical and Health Informatics, Pittsburgh, USA, 10-18 Sep 2023\r\n2.  Hamin Lim, Tae young Lee, “The effect of split sole shoes on lower leg kinematics and Muscle Activities while Walking” International Foot and Ankle Biomechanics 2021, Brazil(Virtual Meeting), 11 -14 April 2021\r\n3.  Hamin Lim, Changwon Wang, Hangsik Shin, “Location Monitoring Platform for Psychiatric Closed Ward” The 55th KIEE Summer Conference 2024, 10-13 Jul 2024\r\n4.  Changwon Wang, Hamin Lim, Hangsik Shin, “Development of a mobile application that can monitor the location of patients in hospitals” The 55th KIEE Summer Conference 2024, 10-13 Jul 2024\r\n5.  Yeongdon Kim, Hamin Lim, Gayeon Ryu, Yujin Han, Hangsik Shin “Development of a Real-Time Upper Limb Range of Motion Measurement Method Using a Single Depth Measurement Camera” The 55th KIEE Summer Conference 2024, 10-13 Jul 2024\r\n6.  Changwon Wang, Hamin Lim, Sung Woo Joo, Jungsun Lee and Hangsik Shin, “Development of a Location Monitoring Platform for Inpatients within Closed Psychiatric Ward” KOSMI 2024 Spring conference, The catholic univrsity of Korea, Seoul, Korea, 19-21 Jun 2024\r\n7.  Hamin Lim, Hangsik Shin “Gravity Compensation of Accelerometer with Madgwick Filter-Based Quaternion Rotation Estimation” 2024 KOSOMBE spring conference, Yonsei University, Won-ju, Korea, 9-11 May 2024\r\n8.  Changwon Wang, Hamin Lim, Hangsik Shin “Real-time location and risk situation alarm platform for inpatients in psychiatric closed wards using Galaxy Watch” Conference on Information and Control Systems, SAINTJOHNS HOTEL, 23-25 Oct 2023\r\n9.  Hamin Lim, Changwon Wang and Hangsik Shin, \"Preliminary Study for the Optimal Attachment Position of Accelerometer for Detecting Abnormal Behavior of Psychiatric Inpatient,\" The 54th KIEE Summer Conference 2023, Yongpyong Resort, Pyeongchang, Republic of Korea, 12-15 Jul 2023\r\n10.  Changwon Wang, Hamin Lim, Sung Woo Joo, Jungsun Lee and Hangsik Shin, \"Analysis of psychiatric inpatients' abnormal behavior prior to self-harm or harm to others through nursing diary records,\" KOSOMBE spring conference2023, KMEDIhub, Daegu, Republic of Korea, 11-13 May 2023\r\n11.  Hamin Lim, Tae young Lee. “Effects of shoe midsole on lower limb kinematics and muscle activity while walking in two different speeds.” The Korean Society of Mechanical Engineers. 12-14 May 2021\r\n12.  Hamin Lim, Tae young Lee “Basic Study on the New Statistical Method of Electromyography Analysis” Korean Society for Precision Engineering, Online 14-16 Oct 2020\r\n\r\n## Patents\r\n\r\n1.  시설 내 대상자 모니터링 시스템, Filed (No: KR10-2023-0197490, Date: 2023/12/29)\r\n\r\n## Registered SW\r\n\r\n1.  심박수, 가속도, 실내 위치 정보 측정을 위한 웨어러블 기기 어플리케이션, , Granted(NO: KRC- 2023-059443, Date: 2023/12/14)\r\n2.  생체정보 및 위치정보 수집, 사용자 위험 분석, 알람 제어를 위한 서버 프로그램, , Granted(NO: KRC-2023-059444, Date: 2023/12/14)\r\n3.  사용자 생체정보 및 위치정보 모니터링, 위험 알림을 위한 웹 응용프로그램, , Granted(NO: KRC- 2023-059445, Date: 2023/12/14)"
  },
  {
    "profile_image": "/images/members/김영돈.jpg",
    "role": "Researcher",
    "name_eng": "Yeongdon Kim",
    "degree": "M.S.",
    "email": "kyd5022@naver.com",
    "tags": "#Software Development #TinyML #Digital Healthcare",
    "hover_image": "/images/members/egg_김영돈2.png",
    "profile_description": "Researcher  \r\n[kyd5022@naver.com](mailto:kyd5022@naver.com)  \r\nResearch Areas : Software development,TinyML,Digital Healthcare",
    "contents": "## PAPERS\r\n\r\n1.  Gayeon Ryu, Yujin Han, Yeongdon Kim, Hangsik Shin, “Bio-signals and result feature analysis to leverage public polysomnography database integration,” The 64th Korea Society of Medical and Biological Engineering Fall Conference 2024, Swiss Grand Hotel, Seoul, Korea (Nov. 2024)\r\n2.  Yeongdon Kim, Hamin Lim, Gayeon Ryu, Yujin Han, Hangsik Shin, \"Development of a Real-Time Upper Limb Range of Motion Measurement Method Using a Single Depth Measurement Camera\", The 55th KIEE Summer Conference, Jeju, Korea (Jul. 2024)\r\n\r\n## skills\r\n\r\nPython,Kotlin,C/C++,Torch,TensorFlow\r\n\r\n## PROJECT\r\n\r\n1.  2021-02 ~ 2021-09 흰개미탐지모델 (하이테크)  \r\n    1\\. 목조 문화제 보호를 위한 흰개미 탐지 모델 구성  \r\n    2\\. 흰개미 데이터 크롤링(구글) 및 직접 촬영한 흰개미 데이터셋을 통해 Yolo v4모델 학습 및 인퍼런스 작업(라즈베리 파이)\r\n2.  2021-02 ~ 2021-09 문화제 기울기를 통한 위험 경보 시스템 (하이테크)  \r\n    1\\. 문화제 보호를 위한 기울기 분석 및 예보  \r\n    2\\. 문화제 건물에 부착된 기울기 센서값을 데이터베이스에 저장 및 분석  \r\n    3\\. LSTM모델을 사용한 기울기 예측\r\n3.  2022-06 ~ 2022-11 고령자 행동인식 모델 개발 (강원대학교, 지오비전)  \r\n    1\\. 엣지컴퓨팅에 들어가는 경량화 모델을 통해 고령자 행인식모델 개발  \r\n    2\\. YOLOX-nano, ONNX, TFLite  \r\n    3\\. 표정인식, 행동인식 Pretrained 모델을 안드로이드에서 적용 가능하도록 경량화작업 진행\r\n4.  2022-06 ~ 2022-11 고려대 병원 정신병동 스마트CCTV 작업 (지오비전, 고려대학교 병원)  \r\n    1\\. 정신병동 환자구분, 환자 행동분석을 통해 스마트병동 구축 작업  \r\n    2\\. PoseC3D, MMDetecion을 사용하여 환자의 행동 분석  \r\n    3\\. 공공데이터 전처리 작업 및 모델 학습 준비 진행\r\n\r\n## awards\r\n\r\n1.  대한의용생체공학회 추계 학술대회 우수 포스터 논문상(금상), 대한의용생체공학회, 2024.11\r\n2.  강원 정밀의료 빅데이터 해커톤 최우수상, 강원정밀의료사업단, 2022.12\r\n3.  AI Hub 학습데이터 활용 사업화 아이디어 해커톤 장려상, 한국스마트미디어학회, 2022.04\r\n4.  강원 애니 데이터톤 우수상, 강원정보문화진흥원, 2022.01"
  },
  {
    "profile_image": "/images/members/유지원.jpg",
    "role": "Researcher",
    "name_eng": "Jiwon You",
    "degree": "M.S.",
    "email": "71one.you@gmail.com",
    "tags": "#Machine learning #Large Language Model #Bioinformatics",
    "hover_image": "/images/members/egg_유지원.JPG",
    "profile_description": "Researcher  \r\n[71one.you@gmail.com](71one.you@gmail.com)  \r\nResearch Areas : Machine learning,Large Language Model,Bioinformatics,",
    "contents": "## Papers & Conferences\r\n\r\n1.  Jiwon You, Hyeon Seok Seok, Sollip Kim and Hangsik Shin. \"Advancing Laboratory Medicine Practice with Machine Learning: Swift yet Exact\" Annals of Laboratory Medicine, 45(1), 22-35, 2025.\r\n2.  Jiwon You, Hangsik Shin. \"Can Large Language Models Analyze Health Data?: For Multi-Stage Items\" The 65th Korea Society of Medical and Biological Engineering Spring Conference 2025, Jeju Lotte Hotel, Jeju Island, Republic of Korea, 8-10 May 2024\r\n3.  Jiwon You, Hangsik Shin. \"Large Language Models and Health Checkup Report Interpretation: Possibilities and Limitations\" The 64th Korea Society of Medical and Biological Engineering Fall Conference 2024, Swiss Grand Hotel, Seoul, Republic of Korea, 07-09 Nov 2024\r\n4.  Hyeon Seok Seok, Jiwon You, Sollip Kim and Hangsik Shin. \"Error Detection in Laboratory Tests using Machine Learning\" The 55th KIEE Summer Conference 2024, ICC jeju, Jeju Island, Republic of Korea, 10-13 Jul 2024\r\n5.  Jiwon You, Sollip Kim, Woochang Lee, Sail Chun and Hangsik Shin. \"Types and Frequencies of Errors in Clinical Chemistry Tests at the University Hospital Clinical Laboratory\" 2024 Korean Society of Medical Informatics (KOSMI) Conference, June 2024\r\n6.  Jiwon You, Yooeun Kim, Kwangsoo Kim, Kyuri Jo. MutTF: a Multi-omics Analysis for Detecting Mutational Signature-induced Gene Regulations by Transcription Factors. The 17th International Conference on Data and Text Mining in Biomedical Informatics (DTMBIO 2023), Dec 18-21, Okinawa, Japan.\r\n7.  Jiwon You, Yooeun Kim, Kwangsoo Kim, Kyuri Jo. \"An Integrated Analysis for Mutational Signatures and Gene Expression Data and Prioritizing Signature-specific Transcription Factors.\" The Journal of Next-generation Convergence Technology Association, 7.8 (2023):1209-1216.\r\n8.  Juho Park, Minseok Oh, Jiwon You, Hyoji Kang, Kyuri Jo. \"Analysis on Prefrontal Cortex Activation During Musical Improvisation and Sight-Reading Using Multiple Linear Regression\" Korea Computer Congress (KCC) 2023, June 2023 (2023): 1853-1855.\r\n9.  Jiwon You, Jeonghwan Yoon, Kyuri Jo. \"Computational framework for time course association study between mutational signature and gene expression\" Korea Computer Congress (KCC) 2021, June 2021 (2021): 2019-2021.\r\n\r\n## Awards\r\n\r\n1.  KCC2023 학부생/주니어 논문 경진대회 장려상, 한국정보과학회, 2023.07\r\n2.  2022 종합학술대회 우수논문상(창업 아이디어 부문), 한국스마트미디어학회, 2022.06\r\n3.  KCC2021 학부생/주니어 논문 경진대회 장려상, 한국정보과학회, 2021.07\r\n\r\n## Participated Projects\r\n\r\n1.  인공지능 기반 일반화학검사 수기 검증 Human Knowledge Transfer 모델 개발, 2025.01~\r\n2.  의학적 진단검사 결과 자동 오류검출 및 피드백 기술 개발, 2024.05~\r\n3.  빅데이터 처리 및 딥러닝/전이학습 모델 개발, 2024.01~2024.12\r\n4.  음악치료 VR 악기개발을 위한 암기연주와 즉흥연주에서의 뇌파분석 연구, 2022.10~2023.09\r\n5.  코로나 19 멀티오믹스 통합분석 및 예후 예측 모델 개발, 2023.04~2023.08\r\n6.  비음수 최소제곱법을 활용한 변이 패턴-유전자 발현 시계열 연관 분석, 2021.07~2023.02"
  },
  {
    "profile_image": "/images/members/이건_0.png",
    "role": "Researcher",
    "name_eng": "Geon Lee",
    "degree": "M.S.",
    "email": "az86028602@gmail.com",
    "tags": "#Biosignal analysis #Medical AI #Machine learning",
    "hover_image": "/images/members/egg_이건.jpeg",
    "profile_description": "Researcher  \r\n[az86028602@gmail.com](mailto:az86028602@gmail.com)  \r\nResearch Areas : Biosignal analysis, Medical AI, Machine learning",
    "contents": "## Papers\r\n\r\n1.  Ji, G., Woo, J., Lee, G., Msigwa, C., Bernard, D., & Yun, J. (2024). AIoT-Based Smart Healthcare in Everyday Lives: Data Collection and Standardization from Smartphones and Smartwatches. IEEE Internet of Things Journal.\r\n2.  홍윤정, 이건, & 우지영. (2024). 컴퓨터 비전 기술을 이용한 하네스 불량 검출 방법. 한국컴퓨터정보학회논문지, 29(1), 77-84.\r\n3.  이나영, 이건, 이민섭, 홍윤정, 양인범, & 우지영. (2024). 객체탐지를 이용한 캠퍼스내 교통안전 시스템 개발. 한국컴퓨터정보학회논문지, 29(1), 51-59.\r\n\r\n## Conferences\r\n\r\n1.  이건, 우지영, & 김상현. (2023). 스케일로그램 이미지와 피쳐 엔지니어링 합성을 통한 딥러닝 기반 침습적 저혈압 예측. 한국정보과학회 학술발표논문집, 925-927.\r\n2.  홍윤정, 이건, 우지영, & 남윤영. (2024). 이더넷 커넥터 자동 조립 기술 개발을 위한 컴퓨터 비전 기반 공정 검사. 한국컴퓨터정보학회 학술발표논문집, 32(1), 89-90.\r\n3.  이건, 우지영, 양인범, 이나영, & 홍윤정. (2023). 객체인식을 활용한 반응형 교통시스템 설계. 한국컴퓨터정보학회 학술발표논문집, 31(1), 23-24.\r\n4.  이건, 홍윤정, 차민수, & 우지영. (2022). 두피 이미지 학습을 통한 두피 상태 진단. 한국컴퓨터정보학회 학술발표논문집, 30(1), 327-329.\r\n\r\n## Awards\r\n\r\n1.  2022.01 - 제주 테크노파크 주관 '자생식물 AI 해커톤' 입상\r\n2.  2022.05 - 통계청 주관 '자연어 기반 AI활용 산업분류 자동화' 입상 (특별상)\r\n3.  2022.12 - 과학기술정보통신부 주관 '데이터 크리에이터 캠프' 입상 (우수상)\r\n4.  2023.12 - 한국정보과학회 주관 '2023 한국소프트웨어종합학술대회' 우수논문상"
  },
  {
    "profile_image": "/images/members/신연주_0.jpg",
    "role": "Researcher",
    "name_eng": "Yeonjoo Shin",
    "degree": "M.S.",
    "email": "shinyeonjoo98@gmail.com",
    "tags": "#Machine learning #Natural Language Processing #Multi-Modal",
    "hover_image": "/images/members/egg_신연주.PNG",
    "profile_description": "Researcher  \r\n[shinyeonjoo98@gmail.com](shinyeonjoo98@gmail.com)  \r\nResearch Areas : Machine learning,Natural Language Processing,Multi-Modal",
    "contents": ""
  },
  {
    "profile_image": "/images/members/전경인_0.png",
    "role": "Administrative Assistant",
    "name_eng": "Kyungin Jeon",
    "degree": "",
    "email": "dls7522@gmail.com",
    "tags": "#Medical Welfare #Administration",
    "hover_image": "/images/members/egg_전경인.JPG",
    "profile_description": "Research Project Mangement and Support  \r\n[dls7522@gmail.com](dls7522@gmail.com)",
    "contents": "## Duty\r\n\r\n1.  Management of National Research Agreement\r\n2.  Management of Research Budget & finance\r\n3.  Management of Researcher contract"
  },
  {
    "profile_image": "/images/members/HyeonSeok_0.png",
    "role": "Research Assistant",
    "name_eng": "Hyeon Seok Seok",
    "degree": "Ph.D. Candidate (Chonnam National University)",
    "email": "shhs4695@gmail.com",
    "tags": "#Biosignal analysis #Digital Healthcare #Medical AI",
    "hover_image": "/images/members/egg_석현석.JPG",
    "profile_description": "Researcher  \r\n[shhs4695@gmail.com](mailto:shhs4695@gmail.com)  \r\nResearch Areas : Biomedical Engineering,Digital Healthcare,Medical AI",
    "contents": "## Papers & Conferences\r\n\r\n1.  Hyeon Seok Seok, Sang Su Kim, Do-Won Kim, Hangsik Shin, “Toward Objectification of Subjective Chronic Pain based on Implicit Response in Biosignals,” IEEE Transactions on Biomedical Engineering, 2024.\r\n2.  Hyeon Seok Seok, Shinae Yu, Kyung-Hwa Shin, Woochang Lee, Sail Chun, Sollip Kim, Hangsik Shin, “Machine learning-based sample misidentification error detection in clinical laboratory tests: A retrospective multicenter study,” Clinical Chemistry, 70(10), 1256-1267, 2024.\r\n3.  Junyung Park, Hyeon Seok Seok, Sang-Su Kim, and Hangsik Shin, \"Photoplethysmogram Analysis and Applications: An Integrative Review,\" Frontiers in Physiology, 12, pp.1-23, 2022\r\n4.  Hyeon Seok Seok and Hangsik Shin, \"Recommendation for Measuring Digital Volume Pulse in a Mobile Application: for Healthy Normal Subject,\" IEEE ACCESS, 9, pp. 69335-69345, 2021\r\n5.  Jin Woong Kim, Hyeon Seok Seok, and Hangsik Shin, \"Is Ultra-Short-Term Heart Rate Variability Valid in Non-static Conditions?,\" Frontiers in Physiology, 12, pp. 596060, 2021\r\n6.  Hyeon Seok Seok, Byung-Moon Choi, Gyu-Jeong Noh, and Hangsik Shin, “Postoperative Pain Assessment Model Based on Pulse Contour Characteristics Analysis,” IEEE Journal of Biomedical and Health Informatics, 23(6), 2317-2324, 2019\r\n7.  Yoon La Yang, Hyeon Seok Seok, Gyu-Jeong Noh, Byung-Moon Choi, and Hangsik Shin, “Postoperative pain assessment index based on Photoplethysmography,” Frontiers in Physiology, 9, 1199, 2018.\r\n8.  Hyeon Seok Seok and Hangsik Shin, “Postoperative Pain Assessment Features Based on Derivative Photoplethysmogram,” The Transaction of Korean Institute of Electrical Engineering (KIEE), 68(10), 1258-1266, 2019\r\n9.  Hyeon Seok Seok and Hangsik Shin, “Investigation of the pulse to pulse interval and amplitude variation of photoplethymogram as a pain assessment parameter during anesthesia,” Journal of the Korean Institute of Intelligent Systems (KIIS), 28(4), 328-334, 2018\r\n10.  Hyeon Seok Seok and Hangsik Shin, “Postoperative Pain Assessment based on Derivative Waveform of Photoplethysmogram,” The Transaction of Korean Institute of Electrical Engineering (KIEE), 67(7), 962-968, 2018\r\n11.  Yoon La Yang, Hyeon Seok Seok, and Hangsik Shin, “Development of an application for correction and arrangement of pulse features of ECG and PPG,” Journal of the Korean Institute of Intelligent Systems (KIIS), 27(6), 566-572, 2017\r\n\r\n## patents\r\n\r\n1.  광용적맥파의 미분 지표를 이용한 수술 후 통증 평가 방법 및 장치, Filed (No: KR1020200066975, Date: 2020/06/03), Published (No: KR1020210150063, Date: 2021/12/10), Granted (No: KR102361725, Date: 2022/02/07)\r\n\r\n## awards\r\n\r\n1.  Best Abstract Awards, Spring Conference, Korean Society for Anesthetic Pharmacology, 2023\r\n2.  Best Paper Awards, 53rd Conference on the Korean Institute of Electrical Engineering (KIEE), 2022\r\n3.  Best Poster Awards, 57th Korea Society of Medical and Biological Engineering Spring Conference 2021 (KOSOMBE), 2021\r\n4.  Best Paper Award, The Korean Institute of Electrical Engineers (KIEE), 2020\r\n5.  Best Paper Award, Autumn Conference, Korean Institute of Intelligent Systems (KIIS), 2017\r\n6.  Best Paper Award, Spring Conference, Korean Institute of Intelligent Systems (KIIS), 2017\r\n\r\n## Participated Projects\r\n\r\n1.  2023.01-2023.12 (On-going): Research Student, Development of Autoverification Algorithm for Laboratory Results Using Artificial Intelligence, Asan Medical Center, South Korea\r\n2.  2023.04-2027.12 (On-going): Research Student, Development and Validation of M3DT for Electroceuticals and Wearable Bio-Signal Medical Device, Ministry of Food and Drug Safety, South Korea\r\n3.  2022.04-2025.12 (On-going): Research Student, Development of AI Software as a Medical Device for Management of Full-Cycle of Atrial Fibrillation Based on Cardiac Digital Twin, Korea Government Skills and Techniques (the Ministry of Science and ICT, the Ministry of Trade, the Ministry of Health & Welfare, the Ministry of Food and Drug Safety), South Korea\r\n4.  2021.04-2023.12 (On-going): Research Student, Development, Optimization, and Clinical Verification of Software for Early Diagnosis and Prognosis of Atrial Fibrillation Integrating Gene, Electrocardiogram, and Clinical Information Based on Artificial Intelligence, Ministry of Health and Welfare (MOHW), South Korea"
  },
  {
    "profile_image": "/images/members/이연진_0.png",
    "role": "Web Developer",
    "name_eng": "Yeonjin Lee",
    "degree": "",
    "email": "thisisyjin@gmail.com",
    "tags": "#Web Application Development #Product Development",
    "hover_image": "/images/members/egg_이연진.png",
    "profile_description": "Web Developer  \r\n[thisisyjin@gmail.com](mailto:thisisyjin@gmail.com)  \r\nInteresting Areas : Web Application Development, Product Development",
    "contents": ""
  }
]
