{
    "title": "공개 수면다원검사 데이터베이스 통합 활용을 위한 생체신호 및 결과 변수 분석",
    "authors": [
        {"name": "Gayeon Ryu", "link": "https://dlab-amc.github.io/htmls/members/Gayeon%20Ryu.html", "affiliation": "2"},
        {"name": "Yujin Han", "link": "https://dlab-amc.github.io/htmls/members/Yu%20Jin%20Han.html", "affiliation": "1"},
        {"name": "Yeongdon Kim", "link": "https://dlab-amc.github.io/htmls/members/Yeongdon%20Kim.html", "affiliation": "1"},
        {"name": "Hangsik Shin", "link": "https://scholar.google.co.kr/citations?user=N1MUdi4AAAAJ&hl=en", "affiliation": "1"}
    ],
    "affiliations": [
        {"id": "1", "name": "Department of Digital Medicine, Asan Medical Center, Brain Korea 21 Project, University of Ulsan College of Medicine, Seoul, Korea"},
        {"id": "2", "name": "Department of Medical Science, Graduate School, University of Ulsan, Seoul, Korea"}
    ],
    "links": {
        "paper": "https://drive.google.com/file/d/1lyRDrBqcQ6U4_r3QpNjRrOmxGYh6vb2C/view?usp=drive_link",
        "poster": "https://drive.google.com/file/d/1qGYeCMq9p_0dKMhD44SBJJTrXJhg4SFW/view?usp=drive_link"
    },
    "abstract":"This study aims to investigate biosignals and sleep analysis parameters in open polysomnography (PSG) databases from the National Sleep Research Resource (NSRR) for efficient researcher utilization. For this purpose, biosignals and sleep analysis parameters from the NSRR databases were investigated based on the biosignal collection manuals and the sleep scoring criteria established by the American Academy of Sleep Medicine. The results categorized the common biosignals and measurement methods used across different databases, and important parameters were identified, allowing for a comprehensive organization of variables used for collection and analysis.",
    "intro": "수면다원검사(PSG)는 수면장애를 진단하기 위해 수면 중 생리적 변화를 기록하는 표준 검사법으로, 뇌파와 심전도 등 다양한 생체신호를 수집하는 것이다. 그러나 PSG는 장시간 기록이 필요해 많은 데이터를 확보하기 어려운 점이 있다. 이를 해결하기 위해 NSRR(National Sleep Research Resource)에서는 28개의 오픈 데이터베이스를 제공하지만, 각 데이터베이스마다 측정기기 사양과 설정이 달라 호환성을 확보하기 위한 추가 작업이 필요하다. 본 연구는 이러한 오픈 PSG 데이터베이스를 효과적으로 활용하기 위해 각 데이터베이스의 생체신호 수집 조건과 분석 파라미터를 비교, 분석하여 호환성 개선에 필요한 정보를 제공하는 것이다.",
    "method": {
        "text": "이 연구에서는 7개의 오픈 데이터베이스(ABC, APPLE, CFS, MESA, SHHS, SOF, WSC)를 사용하여 데이터 분석을 수행한다. APPLE, SHHS, WSC는 추적 관찰 연구로, 대상자와 성별 정보는 첫 방문 기준으로 작성되었다. 대부분의 DB는 성별 비율이 유사하나, SOF는 여성만을 대상으로 한 데이터이다. 연구 대상 연령은 주로 18세 이상 성인이지만, CFS는 6세에서 88세까지 포함하여 연령 범위가 넓다. NSRR의 오픈 DB는 EDF 파일(원신호), XML 파일(수면 정보), CSV 파일(임상 데이터)로 구성된다. \n\n 생체신호는 각 DB의 신호 수집 설명서와 EDF 파일 내 신호 명칭을 바탕으로 조사되었으며, AASM 권장 기준에 따라 신호의 종류를 분류하였다. 권장 전극 대신 백업 전극으로 수집된 경우 동일한 신호로 간주하였으며, 단극과 양극 방식으로 측정된 신호는 별도로 분류하였다. 수면 분석 파라미터는 각 DB 페이지와 XML 파일을 참고하여 조사되었고, AASM 권장 기준을 바탕으로 파라미터의 종류를 분류하였다.",
        "caption": "",
        "image": "img/IBEC_RYU_table1.JPG",
        "imageLink": "#"
    },
    "results": {
        "text": "연구에서 7개의 오픈 데이터베이스를 사용해 수집된 생체신호와 수면 분석 파라미터를 조사한 결과는 다음과 같다. \n\n 생체신호는 뇌파(EEG), 안전도(EOG), 턱 및 다리 근전도(Chin EMG, Leg EMG), 심전도(ECG), 공기 흐름(Airflow), 호흡 노력(RE), 산소 포화도(SpO₂), 자세(Position) 등 9개 범주로 분류되었다. EEG, ECG, 턱 및 다리 EMG는 DB에 따라 단극 또는 양극 방식으로 측정되어 DB 간 차이를 보였다. 예를 들어, EEG 신호는 ABC, CFS, SOF에서 단극 방식으로, APPLE, SHHS, WSC에서 양극 방식으로 측정되었으며, ECG는 모든 DB에서 Lead II 방식을 사용하지만 기록 형식에 차이가 있었다. \n\n 수면 분석 파라미터는 수면 점수, 각성, 심장, 움직임, 호흡 등 5개 범주로 나뉘었다. 모든 DB에 공통적으로 포함된 파라미터는 TST(Total Sleep Time)와 각 수면 단계 비율이었으며, SE(Sleep Efficiency), SL(Sleep Latency)는 ABC를 제외한 모든 DB에서 포함되었다. 각성 및 호흡 카테고리에서는 ArI(Arousal Index), AHI(Apnea-Hypopnea Index) 등 5개 이상의 DB에서 공통적으로 조사되었다. 움직임 카테고리에서는 PLMS(주기적 사지 움직임)가 일부 DB에서 포함되었고, 심장 카테고리는 CFS와 MESA DB에서 수면 중 최소, 최대, 평균 심박수 정보를 제공했다.\n\n 결과적으로, CFS, MESA, SHHS는 모든 수면 분석 파라미터를 포함하고 있었고, ABC는 수면 카테고리, WSC는 호흡 카테고리 일부 파라미터가 포함되지 않은 것으로 확인되었다.",
        "caption": "",
        "image": "img/IBEC_RYU_table2.JPG",
        "imageLink": "#"
    },
    "discussion": {
        "text": "이 연구에서는 NSRR의 오픈 DB를 기반으로 다양한 생체 신호 및 수면 분석 파라미터를 조사하여, 각 DB의 특성을 정리하였다. 대부분의 오픈 DB는 AASM 권장 항목을 포함하고 있었으나, 신호 측정 방식에는 차이가 있었고 공통 파라미터의 종류에도 차이가 있었다. 이러한 결과는 연구자들이 개별 DB 설명서를 검토하는 과정 없이 다양한 오픈 DB를 효율적으로 전처리 할 수 있을 것으로 기대된다. 그러나 조사된 파라미터의 정의와 특징은 AASM 수면 스코어링 매뉴얼과 오픈 DB의 지속적인 업데이트를 반영하여 지속적으로 검토해야 할 필요성이 있다.",
        "caption": "",
        "image": "img/IBEC_RYU_table3.JPG",
        "imageLink": "#"
    },
    "references": [
        "M. Hirshkowitz, “The history of polysomnography: tool of scientific discovery. Sleep Medicine: A Comprehensive Guide to Its Development”, Clinical Milestones, and Advances in Treatment, p. 91-100, 2015.",
        "G. Q. Zhang, et al., “The National Sleep Research Resource: towards a sleep data commons.” Journal of the American Medical Informatics Association, Vol. 25, No. 10, p.1351-1358, 2018.",
        "J. Strøm, et al., “Common sleep data pipeline for combined data sets.”, Plos one, Vol. 19, No. 8, p. e0307202, 2024.",
        "Y. Zhang, et al., “The National Sleep Research Resource: making data findable, accessible, interoperable, reusable and promoting sleep science.” Sleep, Vol. 47, No. 7, 2024.",
        "R. B. Berry, et al., “AASM scoring manual updates for 2017 (version 2.4).” Journal of Clinical Sleep Medicine, Vol. 13, No. 5, p. 665-666, 2017."
    ]
}