{
    "title": "공개 수면다원검사 데이터베이스 통합 활용을 위한 생체신호 및 결과 변수 분석",
    "authors": [
        {"name": "Gayeon Ryu", "link": "https://dlab-amc.github.io/htmls/members/Gayeon%20Ryu.html", "affiliation": "1,2"},
        {"name": "Yujin Han", "link": "https://dlab-amc.github.io/htmls/members/Yu%20Jin%20Han.html", "affiliation": "1"},
        {"name": "Yeongdon Kim", "link": "https://dlab-amc.github.io/htmls/members/Yeongdon%20Kim.html", "affiliation": "1"},
        {"name": "Hangsik Shin", "link": "https://scholar.google.co.kr/citations?user=N1MUdi4AAAAJ&hl=en", "affiliation": "1,2"}
    ],
    "affiliations": [
        {"id": "1", "name": "Department of Digital Medicine, Asan Medical Center, Brain Korea 21 Project, University of Ulsan College of Medicine, Seoul, Korea"},
        {"id": "2", "name": "Department of Medical Science, Graduate School, University of Ulsan, Seoul, Korea"}
    ],
    "links": {
        "paper": "https://drive.google.com/file/d/1lyRDrBqcQ6U4_r3QpNjRrOmxGYh6vb2C/view?usp=drive_link",
        "poster": "https://drive.google.com/file/d/1qGYeCMq9p_0dKMhD44SBJJTrXJhg4SFW/view?usp=drive_link"
    },
    "abstract":"This study aims to investigate biosignals and sleep analysis parameters in open polysomnography (PSG) databases from the National Sleep Research Resource (NSRR) for efficient researcher utilization. For this purpose, biosignals and sleep analysis parameters from the NSRR databases were investigated based on the biosignal collection manuals and the sleep scoring criteria established by the American Academy of Sleep Medicine. The results categorized the common biosignals and measurement methods used across different databases, and important parameters were identified, allowing for a comprehensive organization of variables used for collection and analysis.",
    "intro": "수면다원검사(Polysomnography, PSG)는 수면 중 생리적 변화를 연속적으로 기록하여 수면장애를 진단하는 표준 검사 방법이다 [1]. PSG는 뇌파, 안전도, 심전도와 같은 다양한 생체신호가 수집되는데 PSG 측정을 위해 특별히 구성된 검사실이 요구되며 전체 수면시간 동안 기록되어야 하므로 측정시간이 매우 길어 다수 데이터를 확보하는 것이 어렵다. 따라서, 여러 기관에서 다양한 기기를 통해 측정된 데이터를 통합하여 분석하는 연구들이 수행되고 있다 [2,3]. \n\n데이터 확보의 어려움을 개선하기위해 NSRR(National Sleep Research Resource)은 28개의 오픈 데이터베이스(Database, DB)를 제공하고 있다 [4]. 그러나 NSRR에서 제공되는 DB의 경우에도 각 DB마다 사용된 생체신호 측정기기의 사양과 설정이 달라 데이터베이스를 모아 분석하는 경우 호환성 확보를 위한 별도 작업이 요구되며, 연구목적에 따른 DB 분석 및 복잡한 전처리 과정이 매번 요구된다 [3].\n\n따라서 본 연구에서는 오픈 PSG DB의 통합 활용을 위해 여러 DB내 수집된 생체신호와 수면 분석 파라미터의 특징을 분석하고 호환성 향상을 위한 정보를 제공한다. 이를 위해 오픈 DB마다 제공되는 신호 수집 설명서와 미국수면의학회(American Academy of Sleep Medicine, AASM) 스코어링 매뉴얼을 기준으로 DB별 특징을 조사하고 생체신호 측정 조건과 분석 파라미터를 비교 분석한다.",
    "method": {
        "text": "2.1. 데이터 \n\n데이터는 ABC(Apnea, bariatric surgery, and CPAP study), APPLE(Apnea Positive Pressure Long-term Efficacy Study), CFS(Cleveland Family Study), MESA(Multi-ethnic study of atherosclerosis), SHHS(Sleep Heart Health Study), SOF(Study of osteoporotic fractures), WSC(Wisconsin sleep cohort)으로 총 7개 이다(표 1). APPLE, SHHS, WSC는 추적 관찰된 연구로  연구대상자 및 성별 정보는 웹페이지에 기재된 첫 방문(baseline) 기준으로 작성되었다. SOF를 제외한 모든 DB는 성별 비율이 유사하였지만 SOF는 모두 여성에게서 수집된 데이터이다. 대부분의 DB에서 연구 대상자는 18세 이상 성인으로 한정되지만 CFS는 수면 무호흡의 가족력에 관한 연구로 6세부터 88세까지로 연령의 범위가 넓다. NSRR의 오픈 DB는 원신호 정보를 포함한 EDF(European Data Format) 파일, 수면 정보가 레이블링된 XML(Extensible Markup Language), 그리고 임상 데이터 및 데이터 사전이 포함된 CSV(Comma-Separated Values) 파일로 구성된다. \n\n\n2.2. 생체신호 및 수면 분석 파라미터\n\n선정된 오픈 DB의 수집된 생체신호는 개별 오픈 DB의 신호 수집 설명서 및 몽타주-샘플링 정보와 실제 EDF 파일안에 존재하는 신호 명칭 및 정의를 기준으로 조사되었다. 조사된 신호는 AASM의 권장 신호 수집 방법[5]을 기준으로 신호의 종류를 정의에 맞게 분류하였다. 만약 수집된 신호가 권장 전극 대신 백업 전극으로 측정된 경우 권장 전극으로 측정된 신호와 동일한 신호로 분류하였다. 또한 신호가 같은 종류에 해당함에도 신호의 측정 방식이 단극(Unipolar) 방식과 양극(Bipolar) 방식으로 측정되었을 경우 두 방식을 구분하여 다른 신호로 분류하였다. 오픈 DB의 수면 분석 파라미터는 개별 오픈 DB 페이지에서 제공되는 파라미터 목록과 실제 XML 파일에 포함된 목록을 기준으로 조사되었고 AASM 권장 기준[6]에 따라 수면 분석 파라미터 종류를 분류하였다.",
        "caption": "",
        "image0": "img/IBEC_RYU_table1.JPG",
        "imageLink": "#"
    },
    "results": {
        "text": "생체신호는 뇌파(Electroencephalogram, EEG), 안전도(Electro -oculography, EOG), 턱 근전도(Chin electromyography, Chin EMG), 다리 근전도(Leg electromyography, Leg EMG), 심전도 (Electrocardiogram, ECG), 공기 흐름(Airflow), 호흡 노력 (Respiratory effort, RE), 산소 포화도(Oxygen saturation, SpO2), 자세(Position) 총 9개 범주로 분류되었다. 그리고 수면 분석 파라미터는 수면 점수(Sleep scoring), 각성(Arousal), 심장 (Cardiac), 움직임(Movement), 호흡(Respiratory)의 5개 범주로 분류되었다. 생체신호 측정 설정에 있어 EEG, ECG, 턱 및 다리 EMG는 DB에 따라 단극 또는 양극 방식으로 측정되어 DB간 차이를 보였다. EEG의 경우 ABC, CFS, SOF는 “C3(Left Central)”와 같은 단극 방식으로 측정된 신호를 포함하고 있는 반면, APPLE, SHHS, SOF, WSC은 “C3-M2(Left Central to Right Mastoid)” 또는 “C4-A1(Right Central to Left Mastoid)”와 같은 양극 방식으로 측정된 신호를 포함한다. ECG는 7개의 모든 DB에서 Lead II 방식으로 수집되었으나 ABC, CFS, SOF는 ECG1, ECG2로 (-)와 (+) 신호가 분리되어 기록된 반면, APPLE, MESA, SHHS, WSC는 ECG 또는 EKG 명칭의 양극 측정 방식으로 수집되었다. 턱 EMG는 ABC, CFS, SOF, WSC에서 Chin1(Center Chin EMG), Chin2(Left Chin EMG), Chin3(Right Chin EMG)의 단극 신호와 백업 전극 3개로 분류되었으나 APPLE, MESA, SHHS는 “Chinz”의 양극 측정 방식으로 기록되었다. 다리 EMG도 단일 전극 또는 양극으로 수집 방식에 차이가 있었다. 이외 Airflow, 복부(Abdomen), 흉부(Thorax), SpO2, Position, 코골이(Snore), 맥박(Pulse), 비강압(Nasal pressure)은 5개 이상의 DB에서 공통적으로 수집되었다. 오픈 DB 별 생체신호 측정 설정의 예시는 표 2와 같다.\n\n수면 분석 파라미터의 경우, TST(Total sleep time)와 각 수면 단계별 비율(Percentage of sleep stage)은 모든 DB에 공통적으로 포함된 것으로 확인된다. SE(Sleep efficiency), SL(Sleep latency), Sleep R Latency from Sleep Onset은 ABC를 제외한 모든 DB에서 포함되었으며, TRT(Total recording time)와 WASO(Wake after sleep onset)는 4개(APPLE, CFS, MESA, SHHS) DB에 공통적으로 포함된 것을 확인하였다. 각성 카테고리의 ArI(Arousal index)와 호흡 카테고리의 AHI(Apnea-Hypopnea index), OAI(Obstructive apnea index), CAI(Central apnea index) 및 OAHI(Obstructive apnea-hypopnea index)는 5개 이상의 DB에서 조사되었다. 움직임 카테고리에서는 AASM의 권장 파라미터 중 하나인 수면 중 주기적 사지 움직임 수(PLMS, Periodic Limb Movements of Sleep)가 3개 DB에서 확인되었다. 심장 카테고리는 주로 수면 중 최소, 최대, 평균 심박수가 CFS, MESA DB의 파라미터로 포함되었다. 결과적으로 CFS, MESA, SHHS는 모든 수면 분석 파라미터가 포함되었으며(표 3) ABC는 수면 카테고리, WSC는 호흡 카테고리 중에서 일부 파라미터가 포함되지 않았다.",
        "caption": "",
        "image0": "img/IBEC_RYU_table2.JPG",
        "image1": "img/IBEC_RYU_table3.JPG",
        "imageLink": "#"
    },
    "discussion": {
        "text": "이 연구에서는 NSRR의 오픈 DB를 기반으로 다양한 생체 신호 및 수면 분석 파라미터를 조사하여, 각 DB의 특성을 정리하였다. 대부분의 오픈 DB는 AASM 권장 항목을 포함하고 있었으나, 신호 측정 방식에는 차이가 있었고 공통 파라미터의 종류에도 차이가 있었다. 이러한 결과는 연구자들이 개별 DB 설명서를 검토하는 과정 없이 다양한 오픈 DB를 효율적으로 전처리 할 수 있을 것으로 기대된다. 그러나 조사된 파라미터의 정의와 특징은 AASM 수면 스코어링 매뉴얼과 오픈 DB의 지속적인 업데이트를 반영하여 지속적으로 검토해야 할 필요성이 있다.",
        "caption": "",
        "image": "",
        "imageLink": "#"
    },
    "references": [
        "M. Hirshkowitz, “The history of polysomnography: tool of scientific discovery. Sleep Medicine: A Comprehensive Guide to Its Development”, Clinical Milestones, and Advances in Treatment, p. 91-100, 2015.",
        "G. Q. Zhang, et al., “The National Sleep Research Resource: towards a sleep data commons.” Journal of the American Medical Informatics Association, Vol. 25, No. 10, p.1351-1358, 2018.",
        "J. Strøm, et al., “Common sleep data pipeline for combined data sets.”, Plos one, Vol. 19, No. 8, p. e0307202, 2024.",
        "Y. Zhang, et al., “The National Sleep Research Resource: making data findable, accessible, interoperable, reusable and promoting sleep science.” Sleep, Vol. 47, No. 7, 2024.",
        "R. B. Berry, et al., “AASM scoring manual updates for 2017 (version 2.4).” Journal of Clinical Sleep Medicine, Vol. 13, No. 5, p. 665-666, 2017."
    ]
}